# # 1) for ციკლით დაბეჭდე რიცხვები 1 დან 50 მდე.  
# #    თუ რიცხვი ლუწია -> დაბეჭდე "ლუწი"
# #    თუ კენტია -> "კენტი"  
# #    ფორმატით:  
# #    1 კენტია  
# #    2 ლუწია
# i = 1
# for i in range(1,50):
#     if i % 2 == 0:
#         print(str(i)+" luwia")
#     elif i % 2 !=0:
#         print(str(i)+" kentia")
#         i +=1
#     else:
#         print("nulia")
  
# # 2) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
# #    - თუ რიცხვი იყოფა 3-ზე -> "იყოფა 3-ზე"  
# #    - თუ რიცხვი იყოფა 5-ზე -> "იყოფა 5-ზე"  
# #    - თუ ორივეზე იყოფა -> "იყოფა 3-ზე და 5-ზე" 
# #    - სხვაგვარად -> "არ იყოფა არცერთზე"
# i = 0
# for i in range(20):
#     if i / 3 ==0:
#         print(str(i)+"iyofa samze")
#     elif i / 5 == 0:
#         print(str(i)+"iyofa xutze")
#     elif i / 3 and i / 5:
#         print(str(i)+"iyofa 3-ze da 5-ze")
#         i += 1
# else:
#     print("ar iyofa arcertze")

# # 3) მომხმარებელს შემოატანინე რიცხვი. 
# #    for ციკლით დაითვალე რამდენი ლუწი და რამდენი კენტი რიცხვია დიაპაზონში 0-დან შემოტანილ რიცხვამდე.  
# #    დაბეჭდე შედეგი ამ ფორმატით:  
# #    ლუწი რიცხვების რაოდენობა: X  
# #    კენტი რიცხვების რაოდენობა: Y
# user = int(input("please enter number: "))
# x = 0 
# y = 0   
# for i in range(user):
#     if i % 2 == 0:
#         x += 1
#     else:
#         y += 1

# print("ლუწი რიცხვების რაოდენობა:", x)
# print("კენტი რიცხვების რაოდენობა:", y)


# # 4) მოცემულია სია -> [10, 25, 33, 47, 80, 99]  
# #    for ციკლით დაუარე თითოეულ ელემენტს.  
# #    თუ ელემენტი მეტია 50 ზე -> "მეტი 50-ზე" 
# #    თუ ნაკლებია 50 ზე -> "ნაკლები 50-ზე".
# list = [10, 25, 33, 47, 80, 99]
# for i in list:
#     if i > 50:
#         print("metia 50-ze")
#     elif i < 50:
#         print("naklebia 50-ze")
    

# # 5) for ციკლით დაბეჭდე ყველა ლუწი რიცხვი 0 დან 100 მდე.  
# #    ბოლოს დაბეჭდე -> "ლუწი რიცხვების ჯამია: X".
# luwi = 0
# for i in range(100):
#     if i % 2 == 0:
#         print(i)
#         luwi += i
# print("luwi ricxvebis  jami", luwi )


    

# # 6) შექმენი სია და შეინახეთ შიგნით სტრინგები  
# #    for ციკლით დაბეჭდე მხოლოდ ის სიტყვები, რომლებიც იწყება ასო "a" ზე.
# name = ["ani","gio","nika","alexsi","lika","luka","aleko"]
# for i in name:
#     if name[]

# # 7) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
# #    თუ რიცხვი არის ნული -> "ნულია"  
# #    თუ კენტია -> "კენტია"  
# #    თუ ლუწია -> "ლუწია".
# num = 0
# for i in range(20):
#     if i == 0:
#         print("nulia")
#     elif i %2 !=0:
#         print("kentia")
#     elif i % 2 ==0:
#         print("luwia")

   

# # 8) შექმენი სია -> 
# #    for ციკლით დაუარე სიას და დაბეჭდე მხოლოდ ის ელემენტები, რომლებიც იყოფა 5 ზე.
# number = [5, 15, 25, 35, 45, 55] 
# for i in number:
#     if i % 5 == 0:
#         print(i)
    

# 9) მომხმარებელს შემოატანინე სიტყვა.  
#    for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.
user_name = input("your name: ")
for i in range(len(user_name)):
    print(i)

# 10) შექმენი ცვლადი -> total = 0  
#     for ციკლით დაამატე 1 დან 10 მდე ყველა რიცხვი total-ში.  
#     ბოლოს დაბეჭდე -> "ჯამი არის: X".
total = 0
for i in range(10):
    total += i
print(total)