 
# # 1) შექმენით 10 ელემენტიანი სია. სლაისინგის დახმარებით (დადებითი ინდექსებით):
# # --> გამოიტანეთ პირველი 5 ელემენტი
# # --> გამოიტანეთ ბოლო 3 ელემენტი
# # --> გამოიტანეთ ელემენტები 3 ინდექსიდან 7 ინდექსის ჩათვლით
# num = [1,2,3,4,5,6,7,8,9,10]
# print(num[:5:])
# print(num[7::])
# print(num[3:7:])

# 2) შექმენით 15 ელემენტიანი სია. სლაისების დახმარებით (უარყოფითი ინდექსებით):
# --> გამოიტანეთ პირველი 6 ელემენტი
# --> გამოიტანეთ ბოლო 10 ელემენტი
# --> გამოიტანეთ ელემენტები 7 ინდექსიდან 14 ინდექსის ჩათვლით (გონებაში გადაიყვანეთ უარყოფით ინდექსებში)

number=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
print(number[:6:])
print(number[5::])
print(number[7:14:])

# 3) მოცემულია სიტვა 'თვითმფრინავი'
# გამოიტანეთ 'ნავი'
name = ["tvitmfrinavi"]
print(name[0][8::])
# 4) მოცემულია სიტყვა 'Programmer'. სლაისინგის დახმარებით:
# --> გამოიტანეთ 'Pro' დადებითი და უარყოფითი ინდექსებით
programmer=["programmer"]
print(programmer[0][-10:3:])

# 5) შექმენით სია სადაც შეინახავთ კვირის დღეების სახელებს. სლაისინგის დახმარებით:
# --> გამოიტანეთ სამუშაო დღეები (დადებითი და უარყოფითი ინდექსებით)
# --> გამოიტანეთ დასვენების დღეები (დადებითი და უარყოფითი ინდექსებით)

dgeebi=["orshabati", "samshabati", "otxshabati", "xutshabati", "paraskevi", "shabati", "kvira"]
print(dgeebi[0:-2:])
print(dgeebi[5::])

# 6) მოცემულია წინადადება: 'Python slicing is very powerful'. სლაისინგის გამოყენებით ->
# გამოიტანეთ: 
# 'Python'
# 'slicing'
# 'powerful'
# გამოიყენეთ როგორც დადებითი ასევე უარყოფითი ინდექსებიc

python=['Python slicing is very powerful']
print(python[0][0:6:])
print(python[0][-24:-17:])
print(python[0][-8::])