# 1)დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში 
for i in range(38):
    print(i)

# 2)დაატრილეთ for ციკლი 30 დან 40 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 
for i in range(30, 40):
    print(i)
 
# 3)დაატრიალეთ for ციკლი 12 იდან 120 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 
for i in range(12, 120):
    print(i)

# 4)დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ ასევე გამოიტანეთ თქვენი ასაკიც,ერთ for ციკლში მოათავსეთ ორივე და ეგრე გააკეთეთ
for i in range(19):
    print("nikoloz cindeliai" + " 17 wlis")

# 5)დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში
for i in range(10, 100, 3):
    print(i)

# 6)ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ ,მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი
for i in range(31):
    print(f"{i} msxali")


# 1 ფორთოხალი
# 2 ფორთოხალი
# 3 ფორთოხალი
# 4 ფორთოხალი
# 5 ფორთოხალი
# .... 
# ....
# ....
# 30 ფორთოხალი

# 7)მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop
# for i in range(14):
#     print(input("tqveni asaki "))

# 8)გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით
i = 0
while i < 10:
    print("nika")
    i = i + 1

# 9)დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop
i = 0
while i < 24:
    print(i)
    i = i + 1

