# # # 1)მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით
# user = input("please enter your name: ")

# print(user.upper())

# # # 2)მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით
# user1 = input("please enter your name: ")

# print(user1.lower())

# # # 3)მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი
# user2 = input("please enter your name: ")

# print(user2.capitalize())

# # # 4)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ დიდი ასოებით
# list = ["nika", "gio", "saba", "lika", "mariami"]
# for i in range(len(list)):
#     print(list[i].upper())

# # # 5)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პატარა ასოებით
# list1 = ["NIKOLOZI", "GIORGI", "SABA", "LIKA", "MARI"]
# for i in range(len(list1)):
#     print(list1[i].lower())


# # 6)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს
# list2 = ["nika", "gio", "saba", "lika", "mariami"]
# for i in range(len(list2)):
#     print(list2[i].capitalize())

# # 7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს
# list3 = ["vashli", "msxali", "atami", "fortoxali", "sazamtro"]
# print(len(list3))


# # 8)შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს

# name = "aleqsandre"
# print(len(name))


# # # 9)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა

# list4 = [1, 2, 3, 4, 5, 6, 7, 8, 9 , 10]

# sum = 0

# for num in list4:
#     if num % 2 == 0:
#         sum += 1
# print(sum)


# # 10)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა

# list4 = [1, 2, 3, 4, 5, 6, 7, 8, 9 , 10]

# sum_1 = 0

# for num1 in list4:
#     if num1 % 2 != 0:
#         sum_1 += 1
# print(sum_1)

# # 11)მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები

# start = int(input("Enter start: "))
# end = int(input("Enter end: "))
# step = int(input("Enter step: "))

# for num in range(start, end, step):
#     if num % 2 == 0:
#         print(num)
