# 1)მოცემულია სია --> [1, 2, 3, 4, 5, 6]
# შეცვალე შუა ორი ელემენტი რიცხვებით [10, 20, 30].

num = [1, 2, 3, 4, 5, 6]
num[2:4] = [10, 20, 30]
print(num)

# 2)მოცემულია სია --> ["apple", "banana", "cherry", "kiwi", "mango"]
# შეცვალე პირველი ორი ელემენტი სიით ["pear", "plum"].

xili = ["apple", "banana", "cherry", "kiwi", "mango"]
xili[:2] = ["pear", "plum"]
print(xili)

# 3)ოცემულია სია --> ["a", "b", "c", "d", "e", "f"]
# შეცვალე ბოლო სამი ელემენტი სიით ["x", "y", "z"].
anbani = ["a", "b", "c", "d", "e", "f"]
anbani[3:] = ["x", "y", "z"]
print(anbani)

# 4)მოცემულია სია --> ["red", "green", "blue", "yellow", "black", "white"]
# შეცვალე ინდექსებზე 2-დან 5-მდე ელემენტები სიით ["purple", "orange"].

color = ["red", "green", "blue", "yellow", "black", "white"]
color[2:5] = ["purple", "orange"]
print(color)

# 5)მოცემულია სია --> ["გიორგი" , "ირმა" , "საბა" ]
# შეცვალე მთლიანი სია შემდეგი სიით -->  ["red", "green", "blue", "yellow", "black", "white"]

name = ["გიორგი" , "ირმა" , "საბა" ]
name[::] = ["red", "green", "blue", "yellow", "black", "white"]
print(name)

# ===========================================

# 6) მომხმარებელმა შეიყვანოს რიცხვი — შეამოწმე ლუწია თუ კენტი ეს რიცხვი ,
#  თუ ლუწია დაპრინტე --> "Even" ,თუ კენტია დაპრინტე --> "Odd".
user = int(input("please enter number: "))
if user % 2 == 0:
    print("even")
elif user % 2 != 0:
    print("odd")
else:
    print(nulia)

# 7)შექმენი სია --> სადაც შეინახავ ინტეჯერებს ,
# შემდეგ შეამოწმე თუ სიაში მყოფი მე3 ინდექსზე მდგომი ელემენტი არუს ლუწი დაპრინტე -->
#  "Even number" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი დაპრინტე --> "Odd number"
number = [1,2,3,4,5,6,7,8,9,]
if number[2] % 2 == 0:
    print("even number")
elif number[2] % 2 != 0:
    print("odd number")
else:
    print("nulia")

# 8)შექმენი სია სადაც შეინახავ ინტეჯერებს, თუ სიაში მყოფი ბოლო ელემენტი არის ლუწი და მეტი 50 ზე დაპრინტე --
# > "ეს რიცხვი არის ლუწი და მეტი 50 ზე" , თუ რიცხვი არის კენტი და ნაკლებია 50 ზე დაპრინტე -->
#  "ეს რიცხვი არის კენტი და ნაკლები 50 ზე"

ricxvebi = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
if ricxvebi[-1] % 2 == 0 and ricxvebi[-1] > 50:
    print("ეს რიცხვი არის ლუწი და მეტი 50 ზე")
elif ricxvebi[-1] % 2 != 0 and ricxvebi[-1] < 50:
    print("ეს რიცხვი არის კენტი და ნაკლები 50 ზე")
else:
    print("nulia")

# 9)შექმენი სია სადაც შეინახავ ინტეჯერებს,თუ სიაში მყოფი მე 5 ინდექსზე მდგომი ელემენტი არის ლუწი ან 100 ზე მეტი დაუპრინტე --> 
# "even or more than 100" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი ან ნაკლები 100 ზე დაუპრინტე --> 
# odd or less than 100
list = [100, 90, 80, 70, 60, 50, 40, 30, 20, 10]
if list[5] %2 == 0 or list[5] > 100:
    print("even or more than 100")
elif list[5] % 2 !=0 or list[5] < 100:
    print("odd or less than 100")
else:
    print(nulia)
# ==============================================================

# 10)შექმენი ორი ცვლადი სადაც შეინახავთ სტრინგებს , შემდეგ შეადარე უდრის თუ არა ეს ორი ცვლადი ერთმანეთს ,
#  გამოიყენე ახლად ნასწავლი ოპერატორი != 

name = "nika"
Name = "nika"
print(name != Name)