#  შექმენით ცვლადი სადაც შეინახავთ ბოსტნეულის სახელებს,უნდა გქონდეთ
# სულ 6 ბოსტნეულის სახელი,თქვენი დავალებაა რომ ამ სიაში მყოფი მე 0 ე ინდექსზე მდგომი 
# ელემენტი ჩაანაცვლოთ "viri" ით ,ამ სიაშ მყოფი მესამე დ=ინდექსზე მდგომი ელემენტი
# ჩაანაცვლოთ "tagvit" და ამ სიაში მყოფი მეხუთე ინდექსზე მდგომი ელემენტი ჩაანაცვლოთ "bokveri" ით,
# როდესაც შეცვლი სამივე მნიშვნელობას დაპრინტე საბოლოო განახლებული სია

bostneuli=["stafilo","kitri","kombosto","pomidori","kartofili","xaxvi"]
bostneuli[0]= "viri"
bostneuli[2]= "tagvit"
bostneuli[4]= "bokveri"

print(bostneuli)