# 1) for ციკლის მეშვეობით გამოიტანეთ რიცხვები 10-ის ჩათვლით
for i in range (11):
    print(i)

# 2) while ციკლის მეშვეობით გამოიტანეთ რიცხვები 5-დან 20-მდე.
# ვქმნით ცვლადს, რომელშიც შევინახავთ საწყის რიცხვს
number = 5

while number <= 20:
    print(number)
    number += 1


# 3) კომენტარების სახით ახსენით რა არის conditional statement, რა დანიშნლება გააჩნიათ და როგორი სახის განცხადებები გვაქვს.

# Conditional statement ეს არის პროგრამირების კონსტრუქცია რომელიც განსაზღვრავს,
#  თუ რომელი კოდი უნდა შესრულდეს მოცემული პირობის მიხედვით.

# 4) მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ თუ ასაკი იქნება მეტი ან ტოლი 18-ის მაშინ 
# გამოუტანოს რომ იგი ზრდასრულია,
# ხოლო თუ იქნება 18-ზე ნაკლები საბოლოო გზის მეშვეობით გამოუტანეთ რომ ის მოზარდია.
age = input("your age ")
if age >= 18:
    print("zrdasruli")
else:
    print("mozardi")