# 2) შემოატანინეთ მომხმარებელს რიცხვი 1-დან 12ჩათვლით:
# თუ ეს რიცხვი არის 12, 1, 2 -> დაპრინტეთ ზამთარი
# თუ ეს რიცხვი არის 3, 4, 5 -> დაპრინტეთ გაზაფხული
# თუ ეს რიცხვი არის 6, 7, 8 -> დაპრინტეთ ზაფხული
# თუ ეს რიხცვი არის 9, 10, 11 -> დაპრინტეთ

month = int(input("შეიყვანე თვე (1-12): "))

if month == 12 or month == 1 or month == 2:
    print("ზამთარი")
elif month == 3 or month == 4 or month == 5:
    print("გაზაფხული")
elif month == 6 or month == 7 or month == 8:
    print("ზაფხული")
elif month == 9 or month == 10 or month == 11:
    print("შემოდგომა")
else:
    print("თავიდან სცადე")

